Autodesk.Navisworks.Api.Schema.BooleanField
Represents the definition of a System.Boolean value within a Autodesk.Navisworks.Api.Schema.SchemaDefinition.

Autodesk.Navisworks.Api.Schema.BooleanField.#ctor
Default constructor. No identifier specified.

Autodesk.Navisworks.Api.Schema.BooleanField.#ctor(System.String)
Constructs the field with a given identifier.
Throws System.ArgumentException:
Provided field ID is invalid or missing. 7-bit ASCII without spaces must be used.
Throws System.ArgumentException:
Argument 'id' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.Schema.BooleanField.DefaultValue
Default value that created Autodesk.Navisworks.Api.Schema.SchemaData objects will contain at creation time.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.BooleanField.GetValue(Autodesk.Navisworks.Api.Schema.ReadAccessor)
Gets a value from a given Autodesk.Navisworks.Api.Schema.SchemaData via the associated Autodesk.Navisworks.Api.Schema.ReadAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed

Autodesk.Navisworks.Api.Schema.BooleanField.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.BooleanField.SetValue(Autodesk.Navisworks.Api.Schema.EditAccessor,System.Boolean)
Sets a value into a given Autodesk.Navisworks.Api.Schema.SchemaData via the associated Autodesk.Navisworks.Api.Schema.EditAccessor.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaNotCompiledException' thrown
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidAccessorException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'accessor' is null
Throws System.ArgumentException:
Argument 'accessor' has been Disposed